; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	spectrograph4 - mode
	image3 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	Star5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	Star4 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	Star2 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared0)
	(supports instrument1 image3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation9)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(have_image Star11 spectrograph4)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 image3)
	(have_image Planet14 thermograph2)
	(have_image Phenomenon15 image3)
	(have_image Phenomenon16 thermograph2)
	(have_image Phenomenon17 spectrograph1)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 8
2. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 8
3. (turn_to satellite0 phenomenon17 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 8
4. (take_image satellite0 phenomenon17 instrument2 spectrograph1)
   added: (have_image phenomenon17 spectrograph1)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon12 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon12 instrument2 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 2 of 8
7. (turn_to satellite0 groundstation8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation8)
   goals met: 3 of 8
8. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 8
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 8
10. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 3 of 8
11. (turn_to satellite0 star11 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star11)
   goals met: 2 of 8
12. (take_image satellite0 star11 instrument0 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 3 of 8
13. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 8
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 8
15. (turn_to satellite0 groundstation9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation9)
   goals met: 3 of 8
16. (calibrate satellite0 instrument1 groundstation9)
   added: (calibrated instrument1)
   goals met: 3 of 8
17. (turn_to satellite0 phenomenon13 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 8
18. (take_image satellite0 phenomenon13 instrument1 image3)
   added: (have_image phenomenon13 image3)
   goals met: 4 of 8
19. (turn_to satellite0 phenomenon15 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 8
20. (take_image satellite0 phenomenon15 instrument1 image3)
   added: (have_image phenomenon15 image3)
   goals met: 5 of 8
21. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 5 of 8
22. (take_image satellite0 phenomenon16 instrument1 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 6 of 8
23. (turn_to satellite0 planet14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet14)
   goals met: 6 of 8
24. (take_image satellite0 planet14 instrument1 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 7 of 8
25. (turn_to satellite0 groundstation8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation8)
   goals met: 8 of 8
